# my_model.yaml
nc: 1  # jumlah kelas
depth_multiple: 0.33
width_multiple: 0.50

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, C2f, [128]],
   [-1, 1, SPPF, [128]]]

head:
  [[-1, 1, Conv, [128]],
   [-1, 1, Detect, [nc]]]  # UBAH "Detect" jika kamu rename head jadi DetectCorners
